# üß™ Pr√°cticas por Dataset de Kaggle

| Tipo de conversi√≥n      | Comando Pandas          | Ejemplo                                                 | ¬øQu√© hace?                                                                 |
| ----------------------- | ----------------------- | ------------------------------------------------------- | -------------------------------------------------------------------------- |
| Texto a fecha           | `pd.to_datetime()`      | `df['Fecha'] = pd.to_datetime(df['Fecha'])`             | Convierte strings como `'2022-01-01'` a formato datetime                   |
| Texto a n√∫mero          | `pd.to_numeric()`       | `df['Col'] = pd.to_numeric(df['Col'], errors='coerce')` | Convierte texto como `'123'` a n√∫mero; si falla, pone `NaN` (con `coerce`) |
| Texto a categor√≠a       | `.astype('category')`   | `df['Tipo'] = df['Tipo'].astype('category')`            | Convierte texto repetido en categor√≠as, ahorra memoria                     |
| Texto a n√∫mero entero   | `.astype('int')`        | `df['A√±o'] = df['A√±o'].astype('int')`                   | Convierte valores a enteros (falla si hay `NaN`)                           |
| Texto a decimal (float) | `.astype('float')`      | `df['Precio'] = df['Precio'].astype('float')`           | Convierte a n√∫mero decimal                                                 |
| N√∫mero a texto          | `.astype('str')`        | `df['ID'] = df['ID'].astype('str')`                     | Convierte n√∫meros a texto                                                  |
| Fecha a texto           | `.dt.strftime('%Y-%m')` | `df['FechaTexto'] = df['Fecha'].dt.strftime('%Y-%m')`   | Convierte datetime a string con formato personalizado                      |
| Extraer a√±o de fecha    | `.dt.year`              | `df['A√±o'] = df['Fecha'].dt.year`                       | Obtiene el a√±o de una columna datetime                                     |
| Extraer mes de fecha    | `.dt.month`             | `df['Mes'] = df['Fecha'].dt.month`                      | Obtiene el n√∫mero de mes (1 a 12)                                          |
| Extraer d√≠a de fecha    | `.dt.day`               | `df['D√≠a'] = df['Fecha'].dt.day`                        | Extrae el d√≠a del mes                                                      |
| Extraer nombre del mes  | `.dt.month_name()`      | `df['MesNombre'] = df['Fecha'].dt.month_name()`         | Extrae el nombre del mes (`January`, `February`, etc.)                     |
| Extraer d√≠a de semana   | `.dt.weekday`           | `df['Semana'] = df['Fecha'].dt.weekday`                 | Devuelve 0 (lunes) a 6 (domingo)                                           |
| Redondear decimales     | `.round(n)`             | `df['Precio'] = df['Precio'].round(2)`                  | Redondea a `n` decimales                                                   |
| Reemplazar valores      | `.replace()`            | `df['Col'].replace('-', np.nan, inplace=True)`          | Reemplaza valores (como `"-"` por `NaN`)                                   |
| Quitar s√≠mbolos/texto   | `.str.replace()`        | `df['Precio'] = df['Precio'].str.replace('$', '')`      | Quita o cambia texto espec√≠fico                                            |

## üõçÔ∏è Retail Sales Dataset

üîó Dataset disponible en: [https://www.kaggle.com/datasets/mohammadtalib786/retail-sales-dataset?utm_source=chatgpt.com](https://www.kaggle.com/datasets/mohammadtalib786/retail-sales-dataset?utm_source=chatgpt.com)

In [421]:
# Importat pandas
import pandas as pd

In [422]:
# Cargar el DataSets
df_retail = pd.read_csv('./DataSets/retail_sales_dataset.csv')
df_retail.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

**Pregunta:** ¬øCu√°ntas filas y columnas tiene el dataset?

In [423]:
# Tu c√≥digo aqu√≠
df_retail.shape

(1000, 9)

**Pregunta:** ¬øCu√°les son los tipos de datos de cada columna?

In [424]:
# Tu c√≥digo aqu√≠
df_retail.dtypes

Transaction ID       int64
Date                object
Customer ID         object
Gender              object
Age                  int64
Product Category    object
Quantity             int64
Price per Unit       int64
Total Amount         int64
dtype: object

**Pregunta:** ¬øQu√© productos tienen mayores ventas en cantidad?

In [425]:
# Tu c√≥digo aqu√≠
df_retail.groupby('Product Category')['Quantity'].sum().sort_values(ascending=False)

Product Category
Clothing       894
Electronics    849
Beauty         771
Name: Quantity, dtype: int64

### A√±adir columna de tienda a los 1000 registros

In [426]:
import numpy as np

# Lista de nombres de tiendas ficticias
stores = ['Tienda Norte', 'Tienda Sur', 'Tienda Este', 'Tienda Oeste']

# Asignar aleatoriamente a cada fila
df_retail['Store'] = np.random.choice(stores, size=len(df_retail))

In [427]:
df_retail.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Store
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,Tienda Norte
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,Tienda Oeste
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,Tienda Oeste
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,Tienda Oeste
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,Tienda Oeste

**Pregunta:** ¬øQu√© tiendas venden m√°s productos?

In [428]:
# Tu c√≥digo aqu√≠
df_retail.groupby('Store')['Quantity'].sum().sort_values(ascending=False)

Store
Tienda Norte    686
Tienda Este     657
Tienda Sur      622
Tienda Oeste    549
Name: Quantity, dtype: int64

**Pregunta:** ¬øExisten datos faltantes o duplicados?

In [429]:
# Tu c√≥digo aqu√≠
df_retail.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
Store               0
dtype: int64

In [430]:
# Ver si hay filas duplicadas
df_retail.duplicated().sum()

np.int64(0)

**Pregunta:** ¬øCu√°l es el ingreso total por tienda?

In [431]:
# Tu c√≥digo aqu√≠
df_retail.groupby('Store')['Total Amount'].sum().sort_values(ascending=False)

Store
Tienda Norte    123655
Tienda Este     118300
Tienda Sur      116920
Tienda Oeste     97125
Name: Total Amount, dtype: int64

**Pregunta:** Agrupa las ventas por tipo de producto y encuentra la media de precios.

In [432]:
# Tu c√≥digo aqu√≠
df_retail.groupby('Product Category')['Price per Unit'].mean()

Product Category
Beauty         184.055375
Clothing       174.287749
Electronics    181.900585
Name: Price per Unit, dtype: float64

**Pregunta:** Crea una nueva columna llamada `ingreso_total` que sea precio * cantidad.

In [433]:
# Tu c√≥digo aqu√≠
df_retail['ingreso_total'] = df_retail['Price per Unit'] * df_retail['Quantity']

In [434]:
df_retail.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Store,ingreso_total
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,Tienda Norte,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,Tienda Oeste,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,Tienda Oeste,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,Tienda Oeste,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,Tienda Oeste,100

**Pregunta:** Usa una tabla din√°mica para comparar ingresos por tienda y por producto.

In [435]:
# Tu c√≥digo aqu√≠
pd.pivot_table(df_retail, index='Store', columns='Product Category', values='ingreso_total', aggfunc='sum')

Product Category  Beauty  Clothing  Electronics
Store
Tienda Este        38035     39815        40450
Tienda Norte       40110     40170        43375
Tienda Oeste       30220     28865        38040
Tienda Sur         35150     46730        35040

## üìà Dummy Advertising and Sales Data

üîó Dataset disponible en: [https://www.kaggle.com/datasets/harrimansaragih/dummy-advertising-and-sales-data?utm_source=chatgpt.com](https://www.kaggle.com/datasets/harrimansaragih/dummy-advertising-and-sales-data?utm_source=chatgpt.com)

In [436]:
dummy_df = pd.read_csv('./DataSets/Dummy Data HSS.csv')

In [437]:
dummy_df.head()

     TV      Radio  Social Media Influencer       Sales
0  16.0   6.566231      2.907983       Mega   54.732757
1  13.0   9.237765      2.409567       Mega   46.677897
2  41.0  15.886446      2.913410       Mega  150.177829
3  83.0  30.020028      6.922304       Mega  298.246340
4  15.0   8.437408      1.405998      Micro   56.594181

**Pregunta:** ¬øCu√°l es el gasto promedio en publicidad por canal (TV, Radio, Peri√≥dico)?

In [438]:
# Tu c√≥digo aqu√≠
dummy_df[['TV', 'Radio', 'Social Media']].mean()

TV              54.066857
Radio           18.160356
Social Media     3.323956
dtype: float64

**Pregunta:** ¬øExiste correlaci√≥n entre el presupuesto publicitario y las ventas?

In [439]:
# Tu c√≥digo aqu√≠
dummy_df.corr(numeric_only=True)

                    TV     Radio  Social Media     Sales
TV            1.000000  0.869460      0.528168  0.999497
Radio         0.869460  1.000000      0.607452  0.869105
Social Media  0.528168  0.607452      1.000000  0.528906
Sales         0.999497  0.869105      0.528906  1.000000

**Pregunta:** ¬øQu√© campa√±as tienen ventas superiores a la media?

In [440]:
# Tu c√≥digo aqu√≠
ventas_media = dummy_df['Sales'].mean()
dummy_df[dummy_df['Sales'] > ventas_media]

        TV      Radio  Social Media Influencer       Sales
3     83.0  30.020028      6.922304       Mega  298.246340
6     55.0  24.893811      4.273602      Micro  198.679825
8     76.0  24.648898      7.130116      Macro  270.189400
10    62.0  24.345189      5.151483       Nano  224.961019
12    64.0  20.240424      3.921148      Micro  229.632381
...    ...        ...           ...        ...         ...
4561  60.0  21.841864      5.092528      Macro  210.680016
4563  93.0  25.285149      2.805840      Macro  327.466288
4564  99.0  36.024174      4.288755      Macro  355.807121
4568  71.0  20.610685      6.545573       Nano  249.101915
4570  71.0  17.534640      1.940873      Macro  253.610411

[2239 rows x 5 columns]

In [441]:
ventas_media

np.float64(192.46660210662066)

**Pregunta:** Filtra las campa√±as con publicidad en TV > 200 y Radio > 20.

In [442]:
# Tu c√≥digo aqu√≠
dummy_df[(dummy_df['TV'] > 200) & (dummy_df['Radio'] > 20)]

Empty DataFrame
Columns: [TV, Radio, Social Media, Influencer, Sales]
Index: []

**Pregunta:** Agrupa por canal publicitario y calcula la media de ventas.

In [443]:
# Tu c√≥digo aqu√≠
dummy_df.groupby('Influencer')['Sales'].mean()

Influencer
Macro    195.613601
Mega     190.593666
Micro    191.809095
Nano     191.934304
Name: Sales, dtype: float64

**Pregunta:** Crea una columna de ROI estimado usando una f√≥rmula simple.

In [444]:
# Tu c√≥digo aqu√≠
dummy_df['ROI'] = dummy_df['Sales'] / (dummy_df['TV'] + dummy_df['Radio'] + dummy_df['Social Media'])
dummy_df.head()

     TV      Radio  Social Media Influencer       Sales       ROI
0  16.0   6.566231      2.907983       Mega   54.732757  2.148555
1  13.0   9.237765      2.409567       Mega   46.677897  1.893832
2  41.0  15.886446      2.913410       Mega  150.177829  2.511341
3  83.0  30.020028      6.922304       Mega  298.246340  2.486581
4  15.0   8.437408      1.405998      Micro   56.594181  2.278036

**Pregunta:** Realiza una pivot_table para ver ventas promedio por cada tipo de canal.

In [445]:
#ingreso total por tienda.
pd.pivot_table(dummy_df,index='Influencer',values=['TV', 'Radio', 'Social Media', 'Sales'],aggfunc='mean')

                Radio       Sales  Social Media         TV
Influencer
Macro       18.321927  195.613601      3.369172  55.047449
Mega        18.076145  190.593666      3.373669  53.500000
Micro       18.230631  191.809095      3.273273  53.847958
Nano        18.015812  191.934304      3.280347  53.901582

## üé¨ The Movies Dataset

üîó Dataset disponible en: [https://www.kaggle.com/datasets/rounakbanik/the-movies-dataset?utm_source=chatgpt.com](https://www.kaggle.com/datasets/rounakbanik/the-movies-dataset?utm_source=chatgpt.com)

In [446]:
movies_df = pd.read_csv('./DataSets/MovieFranchises.csv')
movies_df.head(5)

,index,MovieID,Title,Lifetime Gross,Year,Studio,Rating,Runtime,Budget,ReleaseDate,VoteAvg,VoteCount,FranchiseID
0,0,1001,Star Wars: Episode IV - A New Hope,775398007,1977,Lucasfilm,PG,121.0,11000000.0,05-25-77,4.09,96233.0,101.0
1,1,1002,Star Wars: Episode V - The Empire Strikes Back,538375067,1980,Lucasfilm,PG,124.0,18000000.0,06-20-80,4.12,79231.0,101.0
2,2,1003,Star Wars: Episode VI - Return of the Jedi,475106177,1983,Lucasfilm,PG,135.0,32500000.0,05-25-83,3.98,76082.0,101.0
3,3,1004,Jurassic Park,1109802321,1993,Universal Pictures,PG-13,127.0,63000000.0,06-11-93,3.69,82700.0,102.0
4,4,1005,The Lost World: Jurassic Park,618638999,1997,Universal Pictures,PG-13,129.0,73000000.0,05-23-97,3.01,19721.0,102.0

**Pregunta:** ¬øCu√°les son las pel√≠culas con mayor presupuesto?

In [447]:
# Tu c√≥digo aqu√≠
movies_df.sort_values(by='Budget', ascending=False).head()

,index,MovieID,Title,Lifetime Gross,Year,Studio,Rating,Runtime,Budget,ReleaseDate,VoteAvg,VoteCount,FranchiseID
50,50,1051,Avengers: Endgame,2797501328,2019,Marvel Studios,PG-13,181.0,400000000.0,04-26-19,3.91,11841.0,105.0
43,43,1044,Star Wars: Episode VIII - The Last Jedi,1332698830,2017,Lucasfilm,PG-13,152.0,317000000.0,12-15-17,3.31,6467.0,101.0
36,36,1037,Star Wars: Episode VII - The Force Awakens,2069521700,2015,Lucasfilm,PG-13,136.0,306000000.0,12-18-15,3.65,19215.0,101.0
45,45,1046,Avengers: Infinity War,2048359754,2018,Marvel Studios,PG-13,156.0,300000000.0,04-27-18,3.93,15145.0,105.0
33,33,1034,Avengers: Age of Ultron,1402809540,2015,Marvel Studios,PG-13,141.0,280000000.0,04-22-15,3.50,12137.0,105.0

**Pregunta:** ¬øQu√© pel√≠culas obtuvieron mayor ganancia (ingresos - presupuesto)?

In [448]:

# Tu c√≥digo aqu√≠
#movies_df['Profit'] = movies_df['Lifetime Gross'] - movies_df['Budget']
# Aqui el dato de Lifetime Gross lo tenemos qu transformar para poder usar el dato

In [449]:
movies_df.dtypes

index               int64
MovieID            object
Title              object
Lifetime Gross     object
Year               object
Studio             object
Rating             object
Runtime           float64
Budget            float64
ReleaseDate        object
VoteAvg           float64
VoteCount         float64
FranchiseID       float64
dtype: object

In [450]:
# Transformar el tipo de dato de Lifetime Gross
movies_df['Lifetime Gross'] = pd.to_numeric(movies_df['Lifetime Gross'], errors='coerce')

In [451]:
movies_df.dtypes

index               int64
MovieID            object
Title              object
Lifetime Gross    float64
Year               object
Studio             object
Rating             object
Runtime           float64
Budget            float64
ReleaseDate        object
VoteAvg           float64
VoteCount         float64
FranchiseID       float64
dtype: object

In [452]:
movies_df['Profit'] = movies_df['Lifetime Gross'] - movies_df['Budget']

In [453]:
# Mostrar las pel√≠culas con mayor ganancia
top_5 = movies_df[['Title', 'Lifetime Gross', 'Budget', 'Profit']].sort_values(by='Profit', ascending=False).head(5)
top_5

,Title,Lifetime Gross,Budget,Profit
50,Avengers: Endgame,2.797501e+09,400000000.0,2.397501e+09
36,Star Wars: Episode VII - The Force Awakens,2.069522e+09,306000000.0,1.763522e+09
45,Avengers: Infinity War,2.048360e+09,300000000.0,1.748360e+09
56,Spider-Man: No Way Home,1.915878e+09,200000000.0,1.715878e+09
34,Jurassic World,1.671537e+09,150000000.0,1.521537e+09

**Pregunta:** ¬øCu√°ntas pel√≠culas hay por g√©nero?

In [454]:
# Tu c√≥digo aqu√≠
# No hay un genero en este DataSet solo que le lo agreguemos 
# Crear una nueva base
movies_genero_df = movies_df.copy()

# Asignar g√©nero aleatorio solo en la copia
generos = ['Action', 'Comedy', 'Drama', 'Fantasy', 'Sci-Fi', 'Animation', 'Adventure']
np.random.seed(42)
movies_genero_df['Genre'] = np.random.choice(generos, size=len(movies_genero_df))

In [455]:
peliculas_por_genero = movies_genero_df['Genre'].value_counts()
print(peliculas_por_genero)

Genre
Fantasy      99
Action       92
Animation    89
Adventure    88
Comedy       81
Sci-Fi       78
Drama        78
Name: count, dtype: int64

**Pregunta:** ¬øExisten pel√≠culas con presupuesto o ingresos nulos?

In [456]:
# Tu c√≥digo aqu√≠
peliculas_nulas = movies_df[(movies_df['Budget'].isnull()) | (movies_df['Budget'] == 0) |
                            (movies_df['Lifetime Gross'].isnull()) | (movies_df['Lifetime Gross'] == 0)]

In [457]:
peliculas_nulas[['Title', 'Budget', 'Lifetime Gross']]

               Title  Budget  Lifetime Gross
60           MovieID     NaN             NaN
61              1001     NaN             NaN
62              1001     NaN             NaN
63              1001     NaN             NaN
64              1001     NaN             NaN
..               ...     ...             ...
600        Star Wars     NaN          1977.0
601    Jurassic Park     NaN          1993.0
602  Wizarding World     NaN          2001.0
603     Middle Earth     NaN          2001.0
604              MCU     NaN          2008.0

[545 rows x 3 columns]

**Pregunta:** Crea una nueva columna de rentabilidad (ganancia/presupuesto).

In [458]:
# Tu c√≥digo aqu√≠
# Como ya tenemos la columna  de Beneficio entonces solo necesitamos la de rentabilidad
movies_df['Rentabilidad'] = movies_df['Profit'] / movies_df['Budget']

In [459]:
movies_df[['Title', 'Profit', 'Budget', 'Rentabilidad']].head()

,Title,Profit,Budget,Rentabilidad
0,Star Wars: Episode IV - A New Hope,7.643980e+08,11000000.0,69.490728
1,Star Wars: Episode V - The Empire Strikes Back,5.203751e+08,18000000.0,28.909726
2,Star Wars: Episode VI - Return of the Jedi,4.426062e+08,32500000.0,13.618652
3,Jurassic Park,1.046802e+09,63000000.0,16.615910
4,The Lost World: Jurassic Park,5.456390e+08,73000000.0,7.474507

**Pregunta:** Agrupa por a√±o de lanzamiento y calcula ingresos promedio.

In [460]:
# Tu c√≥digo aqu√≠
ingresos_por_year = movies_df.groupby('Year')['Lifetime Gross'].mean()
ingresos_por_year

Year
1977                7.753980e+08
1980                5.383751e+08
1983                4.751062e+08
1993                1.109802e+09
1997                6.186390e+08
1999                1.027083e+09
2001                7.630552e+08
2002                8.272016e+08
2003                1.146436e+09
2004                7.976608e+08
2005                8.825604e+08
2007                9.422017e+08
2008                4.252836e+08
2009                9.344830e+08
2010                8.005019e+08
2011                7.207521e+08
2012                1.267923e+09
2013                9.395408e+08
2014                8.166577e+08
2015                1.415795e+09
2016                9.632719e+08
2017                9.826514e+08
2018                1.144405e+09
2019                1.533010e+09
2021                7.824844e+08
2022                9.040731e+08
Creator                      NaN
George Lucas        1.977000e+03
J. K. Rowling       2.001000e+03
J. R. R. Tolkien    2.001000e+03
Michael Crichton    1.993000e+03
Stan Lee            2.008000e+03
Name: Lifetime Gross, dtype: float64

**Pregunta:** Realiza una tabla din√°mica que compare ingresos por g√©nero y a√±o.

In [461]:
movies_df['Year'] = pd.to_numeric(movies_df['Year'], errors='coerce')

In [462]:
pivot_genero_anio = pd.pivot_table(movies_genero_df,values='Lifetime Gross',index='Genre',columns='Year',aggfunc='sum')

pivot_genero_anio

Year,1977,1980,1983,1993,1997,1999,2001,2002,2003,2004,...,2018,2019,2021,2022,Creator,George Lucas,J. K. Rowling,J. R. R. Tolkien,Michael Crichton,Stan Lee
Genre,,,,,,,,,,,,,,,,,,,,,
Action,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,6.226741e+08,NaN,4.322433e+08,9.977825e+08,NaN,NaN,NaN,2001.0,NaN,NaN
Adventure,775398007.0,NaN,NaN,1.109802e+09,NaN,NaN,1.022290e+09,8.799285e+08,NaN,NaN,...,3.929248e+08,1.074149e+09,4.020649e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Animation,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Comedy,NaN,NaN,NaN,NaN,NaN,NaN,8.980947e+08,NaN,NaN,NaN,...,NaN,NaN,1.915878e+09,NaN,0.0,1977.0,2001.0,NaN,NaN,NaN
Drama,NaN,NaN,NaN,NaN,618638999.0,NaN,NaN,1.601676e+09,1.146436e+09,NaN,...,1.347598e+09,2.260391e+09,NaN,NaN,NaN,NaN,NaN,NaN,1993.0,NaN
Fantasy,NaN,538375067.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.358826e+09,NaN,NaN,1.714437e+09,NaN,NaN,NaN,NaN,NaN,NaN
Sci-Fi,NaN,NaN,475106177.0,NaN,NaN,1.027083e+09,3.687808e+08,NaN,NaN,797660766.0,...,NaN,2.797501e+09,3.797517e+08,NaN,NaN,NaN,NaN,NaN,NaN,2008.0

## üå¶Ô∏è Climate Insights Dataset

üîó Dataset disponible en: [https://www.kaggle.com/datasets/goyaladi/climate-insights-dataset?utm_source=chatgpt.com](https://www.kaggle.com/datasets/goyaladi/climate-insights-dataset?utm_source=chatgpt.com)

In [463]:
df_clima = pd.read_csv('./DataSets/climate_change_data.csv')
df_clima.head()

,Date,Location,Country,Temperature,CO2 Emissions,Sea Level Rise,Precipitation,Humidity,Wind Speed
0,2000-01-01 00:00:00.000000000,New Williamtown,Latvia,10.688986,403.118903,0.717506,13.835237,23.631256,18.492026
1,2000-01-01 20:09:43.258325832,North Rachel,South Africa,13.814430,396.663499,1.205715,40.974084,43.982946,34.249300
2,2000-01-02 16:19:26.516651665,West Williamland,French Guiana,27.323718,451.553155,-0.160783,42.697931,96.652600,34.124261
3,2000-01-03 12:29:09.774977497,South David,Vietnam,12.309581,422.404983,-0.475931,5.193341,47.467938,8.554563
4,2000-01-04 08:38:53.033303330,New Scottburgh,Moldova,13.210885,410.472999,1.135757,78.695280,61.789672,8.001164

In [464]:
df_clima.dtypes

Date               object
Location           object
Country            object
Temperature       float64
CO2 Emissions     float64
Sea Level Rise    float64
Precipitation     float64
Humidity          float64
Wind Speed        float64
dtype: object

In [465]:
# Creamos una columna con los primeros 4 digitos de la columna date para hacer la columna year (a√±os)
df_clima['Year'] = df_clima['Date'].str[:4]

In [466]:
df_clima

,Date,Location,Country,Temperature,CO2 Emissions,Sea Level Rise,Precipitation,Humidity,Wind Speed,Year
0,2000-01-01 00:00:00.000000000,New Williamtown,Latvia,10.688986,403.118903,0.717506,13.835237,23.631256,18.492026,2000
1,2000-01-01 20:09:43.258325832,North Rachel,South Africa,13.814430,396.663499,1.205715,40.974084,43.982946,34.249300,2000
2,2000-01-02 16:19:26.516651665,West Williamland,French Guiana,27.323718,451.553155,-0.160783,42.697931,96.652600,34.124261,2000
3,2000-01-03 12:29:09.774977497,South David,Vietnam,12.309581,422.404983,-0.475931,5.193341,47.467938,8.554563,2000
4,2000-01-04 08:38:53.033303330,New Scottburgh,Moldova,13.210885,410.472999,1.135757,78.695280,61.789672,8.001164,2000
...,...,...,...,...,...,...,...,...,...,...
9995,2022-12-27 15:21:06.966696576,South Elaineberg,Bhutan,15.020523,391.379537,-1.452243,93.417109,25.293814,6.531866,2022
9996,2022-12-28 11:30:50.225022464,Leblancville,Congo,16.772451,346.921190,0.543616,49.882947,96.787402,42.249014,2022
9997,2022-12-29 07:40:33.483348224,West Stephanie,Argentina,22.370025,466.042136,1.026704,30.659841,15.211825,18.293708,2022
9998,2022-12-30 03:50:16.741674112,Port Steven,Albania,19.430853,337.899776,-0.895329,18.932275,82.774520,42.424255,2022
9999,2022-12-31 00:00:00.000000000,West Anthonyburgh,Sao Tome and Principe,12.661928,381.172746,2.260788,78.339658,99.243923,41.856539,2022

In [467]:
df_clima.dtypes

Date               object
Location           object
Country            object
Temperature       float64
CO2 Emissions     float64
Sea Level Rise    float64
Precipitation     float64
Humidity          float64
Wind Speed        float64
Year               object
dtype: object

**Pregunta:** ¬øCu√°ntos registros hay por a√±o?

In [468]:
# Tu c√≥digo aqu√≠

df_clima['Year'].value_counts().sort_index()

Year
2000    436
2001    435
2002    434
2003    435
2004    435
2005    435
2006    434
2007    435
2008    435
2009    435
2010    434
2011    435
2012    436
2013    434
2014    434
2015    435
2016    436
2017    434
2018    435
2019    434
2020    436
2021    434
2022    434
Name: count, dtype: int64

**Pregunta:** ¬øCu√°l es la temperatura media mensual m√°s alta y m√°s baja?

In [469]:
#Creamos una columna con los datos del mes
df_clima['Month'] = df_clima['Date'].str[5:7]

In [470]:
df_clima.head(1)

,Date,Location,Country,Temperature,CO2 Emissions,Sea Level Rise,Precipitation,Humidity,Wind Speed,Year,Month
0,2000-01-01 00:00:00.000000000,New Williamtown,Latvia,10.688986,403.118903,0.717506,13.835237,23.631256,18.492026,2000,01

In [471]:
# Tu c√≥digo aqu√≠
temperatura_media_mensual = df_clima.groupby('Month')['Temperature'].mean()

temperatura_media_mensual = temperatura_media_mensual.sort_values(ascending=False)

temperatura_media_mensual

Month
11    15.290563
02    15.165099
07    15.012949
08    14.968462
06    14.941632
09    14.913659
12    14.907306
03    14.859202
05    14.822854
01    14.817508
10    14.813730
04    14.745375
Name: Temperature, dtype: float64

**Pregunta:** ¬øQu√© meses tienen mayor precipitaci√≥n?

In [472]:
# Tu c√≥digo aqu√≠
precip_mensual = df_clima.groupby('Month')['Precipitation'].mean().sort_values(ascending=False)
precip_mensual.head(10)

Month
09    50.947790
05    50.818566
03    50.494378
10    50.241029
04    50.131147
06    50.130129
12    50.059991
11    49.900964
02    49.550014
01    49.380073
Name: Precipitation, dtype: float64

**Pregunta:** ¬øExisten valores faltantes en alguna columna?

In [473]:
# Tu c√≥digo aqu√≠
df_clima.isnull().sum()

Date              0
Location          0
Country           0
Temperature       0
CO2 Emissions     0
Sea Level Rise    0
Precipitation     0
Humidity          0
Wind Speed        0
Year              0
Month             0
dtype: int64

**Pregunta:** Agrupa por estaci√≥n del a√±o y calcula la media de temperatura.

In [478]:
df_clima.head()

,Date,Location,Country,Temperature,CO2 Emissions,Sea Level Rise,Precipitation,Humidity,Wind Speed,Year,Month,Estacion,Clima
0,2000-01-01 00:00:00.000000000,New Williamtown,Latvia,10.688986,403.118903,0.717506,13.835237,23.631256,18.492026,2000,1,Invierno,templado
1,2000-01-01 20:09:43.258325832,North Rachel,South Africa,13.814430,396.663499,1.205715,40.974084,43.982946,34.249300,2000,1,Invierno,templado
2,2000-01-02 16:19:26.516651665,West Williamland,French Guiana,27.323718,451.553155,-0.160783,42.697931,96.652600,34.124261,2000,1,Invierno,caluroso
3,2000-01-03 12:29:09.774977497,South David,Vietnam,12.309581,422.404983,-0.475931,5.193341,47.467938,8.554563,2000,1,Invierno,templado
4,2000-01-04 08:38:53.033303330,New Scottburgh,Moldova,13.210885,410.472999,1.135757,78.695280,61.789672,8.001164,2000,1,Invierno,templado

In [475]:
# Tu c√≥digo aqu√≠
df_clima['Month'] = df_clima['Month'].astype(int)

mes_estacion = {
    12: 'Invierno', 1: 'Invierno', 2: 'Invierno',
    3: 'Primavera', 4: 'Primavera', 5: 'Primavera',
    6: 'Verano', 7: 'Verano', 8: 'Verano',
    9: 'Oto√±o', 10: 'Oto√±o', 11: 'Oto√±o'
}

df_clima['Estacion'] = df_clima['Month'].replace(mes_estacion)

media_temp_estacion = df_clima.groupby('Estacion')['Temperature'].mean()
print(media_temp_estacion)

Estacion
Invierno     14.957014
Oto√±o        15.003823
Primavera    14.809827
Verano       14.974683
Name: Temperature, dtype: float64

In [479]:
df_clima.head(0)

Empty DataFrame
Columns: [Date, Location, Country, Temperature, CO2 Emissions, Sea Level Rise, Precipitation, Humidity, Wind Speed, Year, Month, Estacion, Clima]
Index: []

**Pregunta:** Crea una columna que clasifique los d√≠as como 'calurosos' o 'templados'.

In [480]:
# Tu c√≥digo aqu√≠
df_clima['Clima'] = 'templado'

df_clima.loc[df_clima['Temperature'] >= 26, 'Clima'] = 'caluroso'

df_clima[['Date','Temperature','Clima']].head()

                            Date  Temperature     Clima
0  2000-01-01 00:00:00.000000000    10.688986  templado
1  2000-01-01 20:09:43.258325832    13.814430  templado
2  2000-01-02 16:19:26.516651665    27.323718  caluroso
3  2000-01-03 12:29:09.774977497    12.309581  templado
4  2000-01-04 08:38:53.033303330    13.210885  templado

**Pregunta:** Genera una pivot_table que muestre la temperatura promedio por a√±o y mes.

In [477]:
# Tu c√≥digo aqu√≠

temp_year_month = pd.pivot_table(df_clima,values='Temperature',index='Year',columns='Month',aggfunc='mean')

temp_year_month

Month,1,2,3,4,5,6,7,8,9,10,11,12
Year,,,,,,,,,,,,
2000,14.206357,13.932424,16.353462,14.956865,15.447593,15.312805,15.628546,15.079403,14.245601,14.634586,15.791594,14.747044
2001,14.708201,16.514600,13.973159,15.036136,14.800959,14.723588,15.254576,15.039348,14.480689,14.634459,15.584229,14.721999
2002,13.620897,14.760417,14.212325,13.850515,13.673576,13.502537,15.576326,14.671967,16.328612,14.936858,15.609769,14.881162
2003,14.885562,16.854469,14.114849,14.987196,14.129527,14.842865,15.227706,15.968507,15.345826,14.831173,15.958393,14.932671
2004,15.914895,13.717340,14.815031,15.814182,15.283723,15.279225,16.452629,15.951439,14.279708,15.091279,15.018508,15.603309
2005,15.310610,14.956032,16.763042,14.461071,16.430089,15.204628,15.133922,15.070869,15.637863,15.126200,16.467725,14.171810
2006,13.021321,14.050059,16.181762,14.232334,15.479402,16.405412,14.475120,13.628186,15.726648,15.800620,14.232370,15.692140
2007,14.419660,14.287890,14.973328,13.083154,15.425498,16.270065,15.347496,15.393289,16.682545,15.696156,15.788519,15.113820
2008,15.947948,15.317924,14.456524,14.146105,15.636002,15.028988,14.423550,15.095044,14.290230,13.657560,15.499798,14.481284
2009,15.004275,13.500589,14.986215,13.581644,13.945644,14.644463,14.477702,16.043215,13.838197,13.994606,14.802935,14.848085
2010,16.430713,16.602293,13.796567,14.304352,14.307113,14.671207,14.375021,14.925134,14.717537,15.053192,14.369786,13.809852
2011,14.799867,13.479437,15.693903,15.139654,14.684203,15.105863,15.690435,15.687834,13.865234,15.437654,15.467247,16.068971
2012,15.014508,14.846005,13.295717,15.058723,13.914326,14.940604,14.006859,13.204141,15.538426,14.538936,15.288107,14.969530
2013,14.817513,15.026508,15.169225,15.652592,15.699235,15.624625,15.951572,14.614062,14.210218,14.339588,14.792342,13.711844
2014,14.211216,17.750663,14.098651,16.129610,15.228852,13.684015,15.053259,13.415877,15.484833,16.763142,15.735282,15.005282
2015,14.241782,15.033940,14.004943,16.138518,14.196789,14.114472,14.048836,14.783575,15.314595,14.618449,14.371005,14.182403
2016,14.670316,15.497960,15.300441,15.048309,16.276688,13.696816,14.551097,15.774117,13.637672,15.458059,15.202107,15.238861
2017,14.916962,16.109878,14.875714,14.620956,14.702661,14.718316,14.430206,16.142818,15.179017,13.392676,14.928116,14.321032
2018,14.459322,13.972831,16.687060,15.402600,13.581579,15.342407,14.933499,15.235965,13.976580,14.518844,13.422849,14.163839
2019,14.979902,15.127148,15.228717,15.051345,15.698920,15.217087,15.397701,14.697973,13.085429,14.792796,16.787389,15.076437
2020,16.365128,16.494077,14.513129,13.769750,14.111491,15.371135,14.828948,14.722336,16.534824,13.441375,15.383780,15.929036
2021,15.004946,14.917552,15.611437,15.020317,14.224062,15.239940,14.669112,14.603044,15.945297,15.155843,15.000113,16.138813
2022,13.855182,16.237678,12.730452,13.669461,14.048418,14.726455,15.354888,14.516170,14.715461,14.762771,16.138990,15.065756